ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/I2C1_1.0.xml
        <register id="I2C1_CRXDATA" width="32" offset="0xC" description="I2C Controller RXData">
            <bitfield id="VALUE" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_CTXDATA" width="32" offset="0x10" description="I2C Controller TXData">
            <bitfield id="VALUE" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_CTPR" width="32" offset="0x14" description="I2C Controller Timer Period">
            <bitfield id="TPR" description="Timer Period 
This field is used in the equation to configure SCL_PERIOD :
SCL_PERIOD = (1 + TPR ) * (SCL_LP + SCL_HP ) * INT_CLK_PRD
where: 
  SCL_PRD is the SCL line period (I2C clock).
  TPR is the Timer Period register value (range of 1 to 127).
  SCL_LP is the SCL Low period (fixed at 6).
  SCL_HP is the SCL High period (fixed at 4).
  CLK_PRD is the functional clock period in ns." begin="6" end="0" width="7" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_CCR" width="32" offset="0x18" description="I2C Controller Configuration">
            <bitfield id="LPBK" description="I2C Loopback" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Normal operation."/>
                <bitenum id="ENABLE" value="0x1" description="The controller in a test mode loopback configuration."/>
            </bitfield>
            <bitfield id="MCTL" description="MultiController mode. In MultiController mode the SCL high time counts once the SCL line has been detected high. If this is not enabled the high time counts as soon as the SCL line has been set high by the I2C controller." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable MultiController mode."/>
                <bitenum id="ENABLE" value="0x1" description="Enable MultiController mode."/>
            </bitfield>
            <bitfield id="ACTIVE" description="Device Active  After this bit has been set, it should not be set again unless it has been cleared by writing a 0 or by a reset, otherwise transfer failures may occur." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the I2C Controller operation."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the I2C Controller operation."/>
            </bitfield>
            <bitfield id="CLKSTRETCH" description="Clock Stretching. This bit controls the support for clock stretching of the I2C bus." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the clock stretching detection. This can be disabled if no Target on the bus does support clock stretching, so that the maximum speed on the bus can be reached."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the clock stretching detection. Enabling the clock stretching ensures compliance to the I2C standard but could limit the speed due the clock stretching."/>
            </bitfield>
        </register>
        <register id="I2C1_CBMON" width="32" offset="0x24" description="I2C Controller Bus Monitor">
            <bitfield id="SCL" description="I2C SCL Status" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2CSCL signal is low."/>
                <bitenum id="SET" value="0x1" description="The I2CSCL signal is high. Note: During and right after reset, the SCL pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
            </bitfield>
            <bitfield id="SDA" description="I2C SDA Status" begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2CSDA signal is low."/>
                <bitenum id="SET" value="0x1" description="The I2CSDA signal is high. Note: During and right after reset, the SDA pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
            </bitfield>
        </register>
        <register id="I2C1_CFIFOCTL" width="32" offset="0x28" description="I2C Controller FIFO Control">
            <bitfield id="TXTRIG" description="TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated." begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="EMPTY" value="0x0" description="Trigger when the TX FIFO is empty."/>
                <bitenum id="LEVEL_1" value="0x1" description="Trigger when TX FIFO contains  1 byte"/>
                <bitenum id="LEVEL_2" value="0x2" description="Trigger when TX FIFO contains  2 byte"/>
                <bitenum id="LEVEL_3" value="0x3" description="Trigger when TX FIFO contains  3 byte"/>
                <bitenum id="LEVEL_4" value="0x4" description="Trigger when TX FIFO contains  4 byte"/>
                <bitenum id="LEVEL_5" value="0x5" description="Trigger when TX FIFO contains  5 byte"/>
                <bitenum id="LEVEL_6" value="0x6" description="Trigger when TX FIFO contains  6 byte"/>
                <bitenum id="LEVEL_7" value="0x7" description="Trigger when TX FIFO contains  7 byte"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
Setting this bit will Flush the TX FIFO. 
Before clearing this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
            <bitfield id="RXTRIG" description="RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_1" value="0x0" description="Trigger when RX FIFO contains &gt;= 1 byte"/>
                <bitenum id="LEVEL_2" value="0x1" description="Trigger when RX FIFO contains &gt;= 2 byte"/>
                <bitenum id="LEVEL_3" value="0x2" description="Trigger when RX FIFO contains &gt;= 3 byte"/>
                <bitenum id="LEVEL_4" value="0x3" description="Trigger when RX FIFO contains &gt;= 4 byte"/>
                <bitenum id="LEVEL_5" value="0x4" description="Trigger when RX FIFO contains &gt;= 5 byte"/>
                <bitenum id="LEVEL_6" value="0x5" description="Trigger when RX FIFO contains &gt;= 6 byte"/>
                <bitenum id="LEVEL_7" value="0x6" description="Trigger when RX FIFO contains &gt;= 7 byte"/>
                <bitenum id="LEVEL_8" value="0x7" description="Trigger when RX FIFO contains &gt;= 8 byte"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before clearing this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
        </register>
