ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/I2C1_1.0.xml
        <register id="I2C1_CFIFOSR" width="32" offset="0x2C" description="I2C Controller FIFO Status Register">
            <bitfield id="RXFIFOCNT" description="Number of Bytes which could be read from the RX FIFO" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="TXFIFOCNT" description="Number of Bytes which could be put into the TX FIFO" begin="11" end="8" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFO Flush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFO Flush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
        </register>
        <register id="I2C1_CONTROLLER_I2CPECCTL" width="32" offset="0x30" description="I2C Controller PEC control register">
            <bitfield id="PECCNT" description="PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Controller use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Target Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.

Note that any write to the Controller_I2CPECCTL Register will clear the current PEC Byte Count in the Controller State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="PEC is disabled in Controller mode"/>
                <bitenum id="ENABLE" value="0x1" description="PEC is enabled in Controller mode"/>
            </bitfield>
        </register>
        <register id="I2C1_CONTROLLER_PECSR" width="32" offset="0x34" description="I2C Controller PEC status register">
            <bitfield id="PECBYTECNT" description="PEC Byte Count	
This is the current PEC Byte Count of the Controller State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates if the PEC was checked in the transaction that occurred before the last Stop"/>
            </bitfield>
            <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
                <bitenum id="SET" value="0x1" description="Indicates if a PEC check error occurred in the transaction that occurred before the last Stop"/>
            </bitfield>
        </register>
        </group>
    <group id="I2C1_TARGET" name="I2C1_TARGET" instances="1" offset="0x1250" instaddr="0x30" description="">
        <register id="I2C1_TOAR" width="32" offset="0x0" description="I2C Target Own Address">
            <bitfield id="OAR" description="I2C Target Own Address: This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by I2CSOAR.MODE bit, the top 3 bits are don't care" begin="9" end="0" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
            </bitfield>
            <bitfield id="OAREN" description="I2C Target Own Address Enable" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable OAR address"/>
                <bitenum id="ENABLE" value="0x1" description="Enable OAR address"/>
            </bitfield>
            <bitfield id="TMODE" description="This bit selects the adressing mode to be used in Target mode.
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="MODE7" value="0x0" description="Enable 7-bit addressing"/>
                <bitenum id="MODE10" value="0x1" description="Enable 10-bit addressing"/>
            </bitfield>
        </register>
        <register id="I2C1_TOAR2" width="32" offset="0x4" description="I2C Target Own Address 2">
            <bitfield id="OAR2" description="I2C Target Own Address 2This field specifies the alternate OAR2 address." begin="6" end="0" width="7" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
            </bitfield>
            <bitfield id="OAR2EN" description="I2C Target Own Address 2 Enable" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The alternate address is disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the use of the alternate address in the OAR2 field."/>
            </bitfield>
            <bitfield id="OAR2_MASK" description="I2C Target Own Address 2 Mask: This field specifies bits A6 through A0 of the Target address.
The bits with value 1 in SOAR2.OAR2_MASK field will make the corresponding incoming address bits to match by default regardless of the value inside SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a dont care." begin="22" end="16" width="7" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x7F" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="I2C1_TCTR" width="32" offset="0x8" description="I2C Target Control Register">
            <bitfield id="ACTIVE" description="Device Active. Setting this bit enables the Target functionality." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the I2C Target operation."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the I2C Target operation."/>
            </bitfield>
            <bitfield id="GENCALL" description="General call response enable
Modify only when UCSWRST = 1.
0b = Do not respond to a general call
1b = Respond to a general call" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Do not respond to a general call"/>
                <bitenum id="ENABLE" value="0x1" description="Respond to a general call"/>
            </bitfield>
            <bitfield id="SCLKSTRETCH" description="Target Clock Stretch Enable" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Target clock stretching is disabled"/>
                <bitenum id="ENABLE" value="0x1" description="Target clock stretching is enabled"/>
            </bitfield>
            <bitfield id="TXEMPTY_ON_TREQ" description="Tx Empty Interrupt on TREQ" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, RIS:TTXEMPTY will be set when only the Target TX FIFO is empty. This allows the TTXEMPTY interrupt to be used to indicate that the I2C bus is being clock stretched and that Target TX data is required."/>
                <bitenum id="ENABLE" value="0x1" description="When 1, RIS:TTXEMPTY will be set when the Target State Machine is in the TX_WAIT state which occurs when the TX FIFO is empty AND the I2C transaction is clock stretched waiting for the FIFO to receive data."/>
            </bitfield>
            <bitfield id="TXTRIG_TXMODE" description="Tx Trigger when Target FSM is in Tx Mode" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When 1, RIS:TXFIFOTRG will be set when the Target TX FIFO has reached the trigger level AND the Target State Machine is in the TXMODE as defined in the SSR register. When cleared RIS:TXFIFOTRG will be set when the Target TX FIFO is at or above the trigger level. This setting can be used to hold off the TX DMA until a transaction starts. This allows the DMA to be configured when the I2C is idle but have it wait till the transaction starts to load the Target TX FIFO, so it can load from a memory buffer that might be changing over time."/>
            </bitfield>
            <bitfield id="TXWAIT_STALE_TXFIFO" description="Tx transfer waits when stale data in Tx FIFO.
This prevents stale bytes left in the TX FIFO from automatically being sent on the next I2C packet. Note: this should be used with TXEMPTY_ON_TREQ set to prevent the Target State Machine from waiting for TX FIFO data without an interrupt notification when the FIFO data is stale." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, the TX FIFO empty signal to the Target State Machine indicates that the TX FIFO is empty."/>
                <bitenum id="ENABLE" value="0x1" description="When 1, the TX FIFO empty signal to the Target State Machine will indicate that the TX FIFO is empty or that the TX FIFO data is stale. The TX FIFO data is determined to be stale when there is data in the TX FIFO when the Target State Machine leaves the TXMODE as defined in the SSR register. This can occur is a Stop or timeout occur when there are bytes left in the TX FIFO."/>
            </bitfield>
            <bitfield id="RXFULL_ON_RREQ" description="Rx full interrupt generated on RREQ condition as indicated in SSR" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, RIS:TRXFULL will be set when only the Target RX FIFO is full. This allows the TRXFULL interrupt to be used to indicate that the I2C bus is being clock stretched and that the FW must either read the RX FIFO or ACK/NACK the current Rx byte."/>
                <bitenum id="ENABLE" value="0x1" description="When 1, RIS:TRXFULL will be set when the Target State Machine is in the RX_WAIT or RX_ACK_WAIT states which occurs when the I2C transaction is clock stretched because the RX FIFO is full or the ACKOEN has been set and the state machine is waiting for FW to ACK/NACK the current byte."/>
            </bitfield>
            <bitfield id="EN_DEFHOSTADR" description="Enable Default Host Address" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When this bit is 0, the default host address is not matched NOTE: it may still be matched if programmed inside SOAR/SOAR2"/>
                <bitenum id="ENABLE" value="0x1" description="When this bit is 1, default host address of 7h000_1000 is always matched by the Target address match logic."/>
            </bitfield>
            <bitfield id="EN_ALRESPADR" description="Enable Alert Response Address" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When this bit is 0, the alert response address is not matched. NOTE: it may still be matched if programmed inside SOAR/SOAR2"/>
                <bitenum id="ENABLE" value="0x1" description="When this bit is 1, alert response address of 7h000_1100 is always matched by the Target address match logic."/>
            </bitfield>
            <bitfield id="EN_DEFDEVADR" description="Enable Deault device address" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When this bit is 0, the default device address is not matched. NOTE: it may still be matched if programmed inside SOAR/SOAR2."/>
                <bitenum id="ENABLE" value="0x1" description="When this bit is 1, default device address of 7h110_0001 is always matched by the Target address match logic."/>
            </bitfield>
            <bitfield id="TWUEN" description="Target Wakeup Enable" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="When 0, the Target is not allowed to clock stretch on START detection"/>
                <bitenum id="ENABLE" value="0x1" description="When 1, the Target is allowed to clock stretch on START detection and wait for faster clock to be abvailable. This allows clean wake up support for I2C in low power mode use cases"/>
            </bitfield>
        </register>
        <register id="I2C1_TSR" width="32" offset="0xC" description="I2C Target Status Register">
            <bitfield id="RREQ" description="Receive Request" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No outstanding receive data."/>
                <bitenum id="SET" value="0x1" description="The I2C controller has outstanding receive data from the I2C Controller and is using clock stretching to delay the Controller until the data has been read from the TRXDATA FIFO (Target RX FIFO is full)."/>
            </bitfield>
            <bitfield id="TREQ" description="Transmit Request" begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No outstanding transmit request."/>
                <bitenum id="SET" value="0x1" description="The I2C controller has been addressed as a Target transmitter and is using clock stretching to delay the Controller until data has been written to the TTXDATA FIFO (Target TX FIFO is empty)."/>
            </bitfield>
            <bitfield id="OAR2SEL" description="OAR2 Address Matched This bit gets reevaluated after every address comparison." begin="3" end="3" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="Either the OAR2 address is not matched or the match is in legacy mode."/>
                <bitenum id="SET" value="0x1" description="OAR2 address matched and ACKed by the Target."/>
            </bitfield>
            <bitfield id="QCMDST" description="Quick Command Status
Value Description:
0: The last transaction was a normal transaction or a transaction has not occurred.
1: The last transaction was a Quick Command transaction" begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The last transaction was a normal transaction or a transaction has not occurred."/>
                <bitenum id="SET" value="0x1" description="The last transaction was a Quick Command transaction."/>
            </bitfield>
            <bitfield id="QCMDRW" description="Quick Command Read / Write 
This bit only has meaning when the QCMDST bit is set. 
Value Description:
0: Quick command was a write
1: Quick command was a read" begin="5" end="5" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="Quick command was a write"/>
                <bitenum id="SET" value="0x1" description="Quick command was a read"/>
            </bitfield>
            <bitfield id="RXMODE" description="Target FSM is in Rx MODE" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The Target State Machine is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
                <bitenum id="SET" value="0x1" description="The Target State Machine is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
            </bitfield>
            <bitfield id="BUSBSY" description="I2C bus is busy" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The I2C Bus is not busy"/>
                <bitenum id="SET" value="0x1" description="The I2C Bus is busy. This is cleared on a timeout."/>
            </bitfield>
            <bitfield id="TXMODE" description="Target FSM is in TX MODE" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The Target State Machine is not in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
                <bitenum id="SET" value="0x1" description="The Target State Machine is in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
            </bitfield>
            <bitfield id="STALE_TXFIFO" description="Stale Tx FIFO" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Tx FIFO is not stale"/>
                <bitenum id="SET" value="0x1" description="The TX FIFO is stale. This occurs when the TX FIFO was not emptied during the previous I2C transaction."/>
            </bitfield>
            <bitfield id="ADDRMATCH" description="Indicates the address for which Target address match happened" begin="18" end="9" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="I2C1_TRXDATA" width="32" offset="0x10" description="I2C Target RXData">
            <bitfield id="VALUE" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
