ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/I2C1_1.0.xml
        <register id="I2C1_TTXDATA" width="32" offset="0x14" description="I2C Target TXData">
            <bitfield id="VALUE" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C1_TACKCTL" width="32" offset="0x18" description="I2C Target ACK Control">
            <bitfield id="ACKOEN" description="I2C Target ACK Override Enable" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="A response in not provided."/>
                <bitenum id="ENABLE" value="0x1" description="An ACK or NACK is sent according to the value written to the ACKOVAL bit."/>
            </bitfield>
            <bitfield id="ACKOVAL" description="I2C Target ACK Override Value
Note: for General Call this bit will be ignored if set to NACK and Target continues to receive data." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="An ACK is sent indicating valid data or command."/>
                <bitenum id="ENABLE" value="0x1" description="A NACK is sent indicating invalid data or command."/>
            </bitfield>
            <bitfield id="ACKOEN_ON_START" description="When set this bit will automatically turn on the Target ACKOEN field following a Start Condition." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following a Start Condition."/>
            </bitfield>
            <bitfield id="ACKOEN_ON_PECNEXT" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the byte received just prior to the PEC byte.
Note that when ACKOEN is set the PEC byte will not automatically be ACKed/NACKed by the State Machine and FW must perform this function by writing Target_SACKCTL." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the byte received just prior to the PEC byte. Note that when ACKOEN is set the PEC byte will not automatically be ACKed/NACKed by the State Machine and FW must perform this function by writing Target_SACKCTL."/>
            </bitfield>
            <bitfield id="ACKOEN_ON_PECDONE" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the received PEC byte." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the received PEC byte."/>
            </bitfield>
        </register>
        <register id="I2C1_TFIFOCTL" width="32" offset="0x1C" description="I2C Target FIFO Control">
            <bitfield id="TXTRIG" description="TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated." begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_4" value="0x4" description="Trigger when TX FIFO contains  4 byte"/>
                <bitenum id="LEVEL_5" value="0x5" description="Trigger when TX FIFO contains  5 byte"/>
                <bitenum id="LEVEL_6" value="0x6" description="Trigger when TX FIFO contains  6 byte"/>
                <bitenum id="LEVEL_7" value="0x7" description="Trigger when TX FIFO contains  7 byte"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
Setting this bit will Flush the TX FIFO.
Before clearing this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before clearing this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
            <bitfield id="RXTRIG" description="RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_5" value="0x4" description="Trigger when RX FIFO contains &gt;= 5 byte"/>
                <bitenum id="LEVEL_6" value="0x5" description="Trigger when RX FIFO contains &gt;= 6 byte"/>
                <bitenum id="LEVEL_7" value="0x6" description="Trigger when RX FIFO contains &gt;= 7 byte"/>
                <bitenum id="LEVEL_8" value="0x7" description="Trigger when RX FIFO contains &gt;= 8 byte"/>
            </bitfield>
        </register>
        <register id="I2C1_TFIFOSR" width="32" offset="0x20" description="I2C Target FIFO Status Register">
            <bitfield id="RXFIFOCNT" description="Number of Bytes which could be read from the RX FIFO" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="TXFIFOCNT" description="Number of Bytes which could be put into the TX FIFO" begin="11" end="8" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFO Flush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFOFlush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
        </register>
